In [2]:
#Import Necessary Packages here!
import numpy as np
import pandas as pd

## Question 1: Slicing and Splicing (and Slaying)

In this question, we're going to practice how we index and select specific parts of dataframes in Pandas. We'll be using the dataframe created below- food_info.

In [3]:
food_info = pd.DataFrame(
    data = {'food': ['Pad Thai', 'Pizza', 'Burger', 'Boba'],
          'restaurant': ['Imm Thai', 'Cheeseboard', 'Super Duper', 'RareTea'],
          'price': [16.00, 24.50, 7.00, 6.50]
          })
food_info

       food   restaurant  price
0  Pad Thai     Imm Thai   16.0
1     Pizza  Cheeseboard   24.5
2    Burger  Super Duper    7.0
3      Boba      RareTea    6.5

### 1a. loc

In this part, let's practice how to use the loc operator. For this, let's...
- Get rows 1 and 3 and column food.
- Get rows 1 and 2 and columns food and restaurant.
- Get rows 0 through 2 (inclusive) and columns food through price.
- Get rows 2 through 3 (inclusive) and columns restaurant and price.

In [14]:
# Solution for Part 1 here!

food_info.loc[0:2:2, 'food']

0    Pad Thai
2      Burger
Name: food, dtype: object

In [21]:
# Solution for Part 2 here!

food_info.loc[0:2, 'food':'restaurant']

       food   restaurant
0  Pad Thai     Imm Thai
1     Pizza  Cheeseboard
2    Burger  Super Duper

In [ ]:
# Solution for Part 3 here!

In [ ]:
# Solution for Part 4 here!

### 1b. iloc

In this part, let's practice how to use the iloc operator. For this, let's...
- Get rows 1 and 3 and column food.
- Get rows 1 and 2 and columns food and restaurant.
- Get rows 0 through 2 (exclusive) and columns food through price.
- Get rows 0 through 3 (exclusive) and columns restaurant and price.

In [40]:
# Solution for Part 1 here!

food_info.iloc[0:3:2, 0:1]

       food
0  Pad Thai
2    Burger

In [44]:
# Solution for Part 2 here!

food_info.iloc[0:2, 0:2]

       food   restaurant
0  Pad Thai     Imm Thai
1     Pizza  Cheeseboard

In [46]:
# Solution for Part 3 here!

food_info.iloc[0:2, 0:3]

       food   restaurant  price
0  Pad Thai     Imm Thai   16.0
1     Pizza  Cheeseboard   24.5

In [49]:
# Solution for Part 4 here!

food_info.iloc[0:3, 1:3]

    restaurant  price
0     Imm Thai   16.0
1  Cheeseboard   24.5
2  Super Duper    7.0

### 1c. New Column!

You can add new columns to a dataframe. Use the Pandas documentation to help you do this!
Add a new column to food_info called 'ratings' where you can put a number from 1-5 rating how good this item of food is.

In [1]:
# Write your code here!

### 1d. Drop it...

You can also drop columns! Drop any column of your choice from food_info. Use the Pandas documentation to help you find the operation you need to do this!

In [2]:
# Write your code here!

### 1e. New Names
Rename the columns of your food_info table such that they are all capitalized! Use the Pandas documentation to help you find the operation you need to do this!

## Question 2: My Heart Will Go On

In this question, we're going to get a glimpse into how data can be 'cleaned' for us to be able to understand and use it effectively- looking at the first few steps of Exploratory Data Analysis as we talked about during lecture and in our demo.

Step 1 of the EDA process is collecting the data- but in our question today we're going to be working with prexisting data from the Titanic. Let's start with importing that data from a CSV file (filename: titanic_data.csv).

In [50]:
# Loading in Data
# This will be loading in the data from the 'titanic_data' csv file. Can you figure out why this files is called a CSV?

titanic = pd.read_csv('titanic_data.csv')

We now have our data (yay)! Our next step is to find and understand the features of the data. In this case, this means understanding what each row and column in the data represents.

### 2a. What's the Data?
What is the shape of this dataset? In other words, how many rows and columns does it have?

In [ ]:
#Your code here!

Alright! Now that we've seen a little bit of the data table, and understood what exactly the data is- here's more of a breakdown of what's in this dataset:

- PassengerId - Count of the total passengers
- Survival - Survival (0 = No; 1 = Yes)
- Class - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
- Name - Passenger's Name
- Sex - Passenger's Gender
- Age - Passenger's Age
- Sibsp - Number of Siblings/Spouses Aboard
- Parch - Number of Parents/Children Aboard
- Ticket - Ticket Number
- Fare - Passenger Fare
- Cabin - Cabin
- Embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)
- Boat - Lifeboat (if survived)
- Body - Body number (if did not survive and body was recovered)

Though we won't be able to look through all of these helpful features, we can now begin to focus on features of our interest and begin actually using our data to come to some fun conclusions!

### 2b. I'm a Survivor

In the dataset, there's a column that shows us how many people survived the crash into the iceberg.
What fraction of the total number of passengers made it safely?

Hint: Determine a method of first, finding how many people survived- and divide this value by the total number of passengers. You can use the value_counts() method.

In [130]:
#Your code here!

survived = pd.value_counts(titanic.loc[:, 'Survived'])
total = sum(titanic['Survived'].value_counts())

survived/total

Survived
0    0.616162
1    0.383838
Name: count, dtype: float64

### 2c. Guest List
Another important process of analyzing data is being able to organize it in an effective method for your analysis.
Let's say that you want to look at the names of the passengers in alphabetical order- organize the data table by alphabetical order of passenger names.

Print out this new datatable with the passengers ordered alphabetically by their name- but starting with the Z names first.

Hint: You can use the sort_values() function on pandas. Look at what the different input parameters do!

In [86]:
#Your code here!

titanic.sort_values(by=['Name'], ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
361,362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,NaN,C
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,NaN,S
286,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S

### 2d. Numbers, Numbers, Numbers
Statistics are important for working with data. A lot of the time, we want to understand overall trends in data, and statistical measures are very helpful for this. Here are some things we can investigate:
- What was the mean age of all of the passengers? What about the standard deviation?
- What was the instance of the maximum number of Parents/Children aboard? What about the maximum number of Siblings/Spouses?

In [121]:
# Mean Age of Passengers

SyntaxError: invalid syntax (1482867851.py, line 5)

In [ ]:
# Standard Dev of Passenger Age

In [ ]:
# Maximum Number Parents/Children Aboard

In [ ]:
# Maximum Number of Siblings/Spouses Aboard

### 2e. Ooh that's Pricey...
Some people had to pay a higher fare than others in order to secure their spot on this ship. Print out the 10 people who spent the most money on their fare for the Titanic.

Hint 1: You may find sort_values() helpful.

Hint 2: You'll need to somehow get the names only, NOT the counts associated with each. If you're not sure how to do this, try looking through the class notes or using a search engine. We know this is annoying but we're trying to help you build independence.

Hint 3: To check your answer, this should return a list of 10 names- it should not be a number.

In [ ]:
# Your code here!

### 2f. not the NaNs...
If you look at certain data entries, you may notice an interesting feature- NaN. This stands for Not a Number- and it basically shows us 'missing' or incorrectly represented data. In this case, the "Cabin" column has a lot of NaN values, which means they likely have a significance. We often will want to drop or appropriately replace the NaN values in a dataset- but in this question, let's just look at all of the entries that have a NaN in the "Cabin" column.

Print out a datatable from the original dataframe that only contains the rows with NaN in the "Cabin" column.

In [ ]:
#Your code here!

### 2g. Group Up!

A lot of times, when we look at our data we want to look at it in different 'groups' to understand how features are related. For this question, let's take a look at how the other features relate to where the passengers embarked on the journey (C = Cherbourg; Q = Queenstown; S = Southampton).

Group by the embarkation and print out your result.

Hint: You will have to use an aggregation function (e.g, count, mean, median, sum, max...) to find the totals.

When this is done, you'll see that some columns no longer contain useful information- such as PassengerId and Age- but others provide us with valuabe insights such as the Surivived, and Fare columns which tell us the total fare collected at each port, and how many people survived according to where they boarded the ship.

In [ ]:
#Your code here!